* Bottom heading but moved to the top with M-<up>

* tables:
| Date             | weight |
|------------------+--------|
| <2022-07-07 Thu> |    174 |
| <2022-07-08 Fri> |    219 |
| <2022-07-09 Sat> |    182 |
| <2022-07-10 Sun> |     20 |
| <2022-07-11 Mon> |    128 |
|------------------+--------|
| Average          |  144.6 |
#+TBLFM: @7$2=vmean(@2$2..@6$2)

| Data             |    Weight |
| <2022-07-24 Sun> |     173.3 |
| <2022-07-25 Mon> |     174.2 |
| <2022-07-26 Tue> |     182.2 |
| <2022-07-27 Wed> |     173.2 |
| <2022-07-28 Thu> |       192 |
| <2022-07-29 Fri> |     182.2 |
| <2022-07-30 Sat> |     182.1 |
|------------------+-----------|
| Avg              | 179.88571 |
#+TBLFM: @9$2=vmean(@2..@8)

** links:

[[https://github.com/Lawqup/config][link to dotfiles repo]]

** text types 

/this is italics/
*this is bold*
~this is code~
+strikethrough+
_underscore_
=verbatim=


** lists:

- [X] bro
- [ ] do
- [X] ?
  
1. 2
2. 3
3. bro


  
* broheading content

*bro* this is too large

* Other heading
* code

** elisp
#+begin_src emacs-lisp

  (defun brofunc ()
    (message "bro!"))

  (brofunc)

#+end_src

#+RESULTS:
: bro!

** TODO enable python
#+begin_src python
  print("a")
#+end_src

